const PP_UNIT = {
  '고라파덕': 50, '깨비참': 40, '꼬렛': 30, '니드런♀': 80, '니드런♂': 60, '두두': 40, '마그비': 60, '모래두지': 70, '발챙이': 50,
  '뽀뽀라': 70, '쏘드라': 50, '아라리': 70, '코일': 60, '콘치': 70, '콘팡': 40, '파라스': 100, '푸푸린': 60,
  '나옹': 50, '내루미': 70, '디그다': 40, '모다피': 50, '뿔충이': 60, '파오리': 40, '슬리프': 50, '아보': 50, '야돈': 80,
  '잉어킹': 70, '쥬쥬': 50, '크랩': 40, '탕구리': 60, '포니타': 40, '핑복': 60, '흉내내': 80,
  '고오스': 30, '구구': 50, '꼬마돌': 70, '꼬부기': 40, '뚜벅쵸': 60, '미뇽': 50, '뿔카노': 80, '삐': 60, '셀러': 70,
  '알통몬': 40, '암나이트': 60, '에레키드': 50, '이브이': 40, '이상해씨': 60, '주뱃': 30, '캐이시': 50, '캐터피': 50, '파이리': 50,
  '신뇽': 50, '야도란': 70, '야도킹': 70, '덩쿠리': 80, '또가스': 40, '망키': 30, '배루키': 60, '별가사리': 40, '쁘사이저': 30,
  '왕눈해': 60, '질퍽이': 80, '캥카': 50, '켄타로스': 60, '투구': 60, '폴리곤': 40, '해피너스': 70, '식스테일': 60,
  '가디': 40, '갸라도스': 60, '라프라스': 50, '롱스톤': 70, '망나뇽': 60, '먹고자': 30, '스라크': 40, '저승갓숭': 60,
  '팬텀': 40, '프테라': 60, '후딘': 50, '뮤': 80, '뮤츠': 8, '썬더': 60, '파이어': 50, '프리져': 70
};

const PP_FORM = {
  '단데기': 70, '버터플': 40, '폴리곤Z': 50, '아르코': 70, '부스터': 30, '에브이': 60, '블래키': 60, '핫삼': 60, '사마자르': 60,
  '뚜벅쵸·꽃잎댄스': 70, '냄새꼬·꽃잎댄스': 70, '스라크·벌레먹기': 60
};

const PP_RULE = {
  perAttack: 10,
  hitRaw: 0.01,
  hitReal: 0.07,
  hitCap: 42.5,
  lock: 1,
  event: 10,
  pool: 2.5
};
